In [2]:
import pandas as pd
import numpy as np

In [5]:
veri = {"İstanbul": [30,29,np.nan],"Ankara": [20,np.nan,25], "Sivas": [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(veri)

In [6]:
havaDurumuDataFrame

   İstanbul  Ankara  Sivas
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [8]:
havaDurumuDataFrame.dropna()           # nan olan satırları siliyor

   İstanbul  Ankara  Sivas
0      30.0    20.0     40

In [10]:
havaDurumuDataFrame.dropna(axis = 1)   #nan olan sütunları siler

   Sivas
0     40
1     39
2     38

In [14]:
yeniVeri = {"İstanbul": [30,29,np.nan],"Ankara": [20,np.nan,25], "Sivas": [40,39,38],"Antalya": [45, np.nan, np.nan]}
havaDurumuDataFrame = pd.DataFrame(yeniVeri)
havaDurumuDataFrame

   İstanbul  Ankara  Sivas  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [15]:
havaDurumuDataFrame.dropna(axis = 1, thresh=2)  #sütunlarda 2 ve 2 üzeri nan olan sütunu siler

   İstanbul  Ankara  Sivas
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [18]:
havaDurumuDataFrame.fillna(20)  #nan yerine 20 değerin vermek için..

   İstanbul  Ankara  Sivas  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

# groupby
bizim sınıflarımızı gruplar. multiIndex olmasına gerek yok herhangi kolondan oluşturabiliriz.

In [23]:
isYeri = {"Departman": ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
         "Calisan Kişiler": ["Fatih", "Sultan", "Mehmet", "Büşra", "İlayda", "Zeynep"],
         "maaş": [100,200,300,400,500,600]}

In [24]:
isYeriDataFrame = pd.DataFrame(isYeri)

In [25]:
isYeriDataFrame

   Departman Calisan Kişiler  maaş
0    Yazılım           Fatih   100
1    Yazılım          Sultan   200
2  Pazarlama          Mehmet   300
3  Pazarlama           Büşra   400
4      Hukuk          İlayda   500
5      Hukuk          Zeynep   600

In [28]:
grupObjesi = isYeriDataFrame.groupby("Departman")

In [29]:
grupObjesi.count()        # saymak demektir. her departmanda ki kişi sayısı ve maaş alan sayısı verir.

           Calisan Kişiler  maaş
Departman
Hukuk                    2     2
Pazarlama                2     2
Yazılım                  2     2

In [30]:
grupObjesi.mean()         #ortalama hesaplanır

           maaş
Departman
Hukuk       550
Pazarlama   350
Yazılım     150

In [31]:
grupObjesi.min()

          Calisan Kişiler  maaş
Departman
Hukuk              Zeynep   500
Pazarlama           Büşra   300
Yazılım             Fatih   100

In [32]:
grupObjesi.max()

          Calisan Kişiler  maaş
Departman
Hukuk              İlayda   600
Pazarlama          Mehmet   400
Yazılım            Sultan   200

In [33]:
grupObjesi.describe()

           maaş
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
Pazarlama   2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Yazılım     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0